<?php
// Variable Swaping -
    $fname = "Isaac";
    $lname = "Newton";
    $mname = "Nothing";

    printf("His name is %s %s",$fname,$lname);
    echo "\n";
    printf("His name is %s %s",$lname,$fname);
    echo "\n";
    printf('His name is %2$s %1$s',$fname,$lname);  //  swaping
    echo "\n";
    echo "\n";

// ------------------------------------------------

printf('His name is %3$s %1$s %2$s',$fname,$mname,$lname);
// %3$s = $lname        %1$s = $fname       %3$s = $mname


echo "\n";

// -------------------------------------------------

// 1 value using 2 places with swaping -
    printf('The binary equivalent of %1$d is %1$b', 12);
    echo "\n";

/* ================================================================ */
// . দশমিক এর পর ২ সংখ্যায় প্রকাশ করতে বললে -
$n = 45.126;
printf("%.2f",$n);      //  45.13
echo "\n";
/* 
Note :
45.124 = 45.12
45.125 = 45.12
45.126 = 45.13
*/

/* ================================================================ */

/* 
যদি আমাকে ৪ সংখ্যার কম কোন সংখ্যা দেওয়া হয়, এবং ৪ সংখ্যাতে তাকে পূর্ণ করতে বলে -
যেমন - 
$m = 123;   # 0123
$n =27;     # 0027

 */

 $m = 123; 
 $n =27;
 printf("%04d \n", $m);     //  0123 
 printf("%04d \n", $n);     //  0027 

/* ================================================================ */

/* 
যদি আমাকে দশমিক এর কোন সংখ্যা দেওয়া হয়, তারপর যদি বলা হয় যে, দশমিকের আগে ৪ সংখ্যা রেখে দশমিকের পরে ২ টা সংখ্যা দেখানোর জন্য  -
যেমন - 
$m = 123.3253;   # 0123.32
$n =27.155;     # 0027.15

*/
$m = 123.3253;
$n = 27.155;
printf("%07.2f \n", $m);    //  0123.33 
printf("%07.2f \n", $n);    //  0027.16 
