<?php

// operator precedence
// এটার মূল কাহিনী হচ্ছে কে কার আগে run করবে

// Or -
$f = (false || true); // true
# এইখানে || চিহ্ন এটার ভেলু বেশী, তাই এটার কাজ আগে হইসে  এবং = চিহ্ন এটার ভেলু কম, তাই এটার কাজ পরে হইসে

$e = false or true; // ($e = false) or true     // $e = false
# এইখানে or সিম্বল এটার ভেলু কম, তাই এটার কাজ পরে হবে  এবং = চিহ্ন এটার ভেলু বেশী, তাই এটার কাজ আগে হইসে

var_dump($f, $e);

/*
  output :
    bool(true)
    bool(false)
 */

// ---------------------

// And -
$f = true && false; // false
# এইখানে && চিহ্ন এটার ভেলু বেশী, তাই এটার কাজ আগে হইসে  এবং = চিহ্ন এটার ভেলু কম, তাই এটার কাজ পরে হইসে

$e = true and false; // ($e = true) and false     // $e = true
# এইখানে and সিম্বল এটার ভেলু কম, তাই এটার কাজ পরে হবে  এবং = চিহ্ন এটার ভেলু বেশী, তাই এটার কাজ আগে হইসে

var_dump($f, $e);

/*
  output :
    bool(false)
    bool(true)
 */
